## Examples I

In [30]:
# Examples I
import numpy as np
import pandas as pd
from env import get_db_url

In [31]:
url = get_db_url('employees')

In [32]:
pd.read_sql('SELECT * FROM employees', url)

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [34]:
employees = pd.read_sql('SELECT * FROM employees', url)

In [35]:
titles = pd.read_sql('SELECT * FROM titles', url)

In [6]:
type(employees)

pandas.core.frame.DataFrame

In [7]:
type(titles)

pandas.core.frame.DataFrame

In [8]:
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [9]:
employees.shape

(300024, 6)

In [10]:
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [11]:
titles.shape

(443308, 4)

In [12]:
#8
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [13]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [14]:
#9
sql = '''
SELECT DISTINCT title FROM titles;
'''
unique_titles = pd.read_sql(sql, url)
unique_titles

                title
0     Senior Engineer
1               Staff
2            Engineer
3        Senior Staff
4  Assistant Engineer
5    Technique Leader
6             Manager

In [15]:
titles.nunique()

emp_no       300024
title             7
from_date      6393
to_date        5888
dtype: int64

In [16]:
#10
titles.groupby('to_date').min()

            emp_no               title   from_date
to_date
1985-03-01   20869            Engineer  1985-02-17
1985-03-11  474918            Engineer  1985-02-10
1985-03-20  434232               Staff  1985-02-26
1985-03-23   34059     Senior Engineer  1985-02-10
1985-04-17  287732               Staff  1985-04-14
...            ...                 ...         ...
2002-07-29   20505  Assistant Engineer  1987-11-29
2002-07-30   18112  Assistant Engineer  1989-10-28
2002-07-31   11698  Assistant Engineer  1993-04-25
2002-08-01   20278  Assistant Engineer  1985-02-10
9999-01-01   10001  Assistant Engineer  1985-02-01

[5888 rows x 3 columns]

In [17]:
titles.to_date.agg('min')

datetime.date(1985, 3, 1)

In [18]:
titles.to_date.sort_values().head(1)

16064    1985-03-01
Name: to_date, dtype: object

In [27]:
#11
pd.read_sql('SELECT max(to_date) FROM titles LIMIT 1 WHERE NOT to_date LIKE '9999%', get_db_url)

NameError: name 'mpg' is not defined

In [ ]:
titles.to_date.agg('max')

In [ ]:
titles.groupby('to_date').max()

In [ ]:
pd.concat([employees, titles], axis=1)

## Examples II

In [ ]:

#1a Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

#1b Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [ ]:
users

In [ ]:
roles

In [ ]:
#2 Using right join
pd.merge(users,roles, on='id', how= 'right', indicator = True)

In [ ]:
#3 Using outer join
pd.merge(users,roles, left_on='role_id', right_on='id', how= 'outer',indicator = True)
#Nans included

In [ ]:
users.keys()

In [ ]:
roles.keys()

In [ ]:
#4 Drop foreign keys and try to merge
users_drop = users.drop(columns='role_id')
users_drop

In [ ]:
roles

In [ ]:
pd.merge(users_drop, roles, on='id')

In [ ]:
#4 Drop foreign keys and try to merge
pd.merge(users,roles, on='id', how= 'outer').drop('id',axis=1)
#Mixed up info.

In [ ]:
#5 Import mpg dataset
from pydataset import data

In [ ]:
#6 Output and read mpg
mpg = data('mpg')
mpg.head()

In [ ]:
#7 How many rows and colums
mpg.shape

In [ ]:
#8 Check column names and clean up if needed
#mpg.columns
#mpg.columns.tolist()
mpg = mpg.rename(columns={'displ':'displacement', 'cyl':'cylinders', 'trans':'transmission', 'drv':'drive','cty':'city','hwy':'highway','fl':'fuel'})
mpg.head()

In [ ]:
#9 Display summary stats
mpg.describe(exclude=np.number)

In [ ]:
#10
mpg['manufacturer'].nunique()

In [ ]:
mpg.manufacturer.nunique()

In [ ]:
#11
mpg['model'].nunique()

In [ ]:
mpg.model.nunique()

In [ ]:
#12
mpg['mileage_difference'] = (mpg.highway - mpg.city)
mpg

In [ ]:
#13
mpg['average_mileage'] = mpg[['city','highway']].mean(axis=1)
mpg

In [ ]:
mpg.assign(mileage_difference= mpg.highway-mpg.city,
          average_mileage = (mpg.city + mpg.highway)/2)

In [ ]:
#14
mpg['is_automatic'] = mpg.transmission.str.startswith('auto')
mpg

In [ ]:
mpg.describe(exclude=np.number)

In [ ]:
#15
best_mpg = mpg.groupby('manufacturer').average_mileage.mean().nlargest(1, keep= 'all')
best_mpg

In [ ]:
mpg.groupby('manufacturer').average_mileage.mean().sort_values(ascending=False).round(2)

In [ ]:
#16
who_has_best_mpg = np.where(mpg.groupby('is_automatic').average_mileage.mean().nlargest(1,keep='all'), 'Manuals have better mpg', 'Autos have better mpg')
who_has_best_mpg

In [ ]:
# Boolean
mpg.groupby('is_automatic')[['city', 'highway']].mean().sort_values(by= 'highway', ascending =False)

In [ ]:
# Use np.where
mpg['transmission_category'] = np.where(mpg.transmission.str.startswith('a'), 'auto', 'manual')
mpg.head()

In [ ]:
#Average of transmissions' mileage
mpg.groupby('transmission_category')[['city', 'highway']].mean()

## Examples III

In [ ]:
#1
chipotle_url = get_db_url('chipotle')
chipotle = chipotle_url

In [ ]:
chipotle = pd.read_sql('SELECT * FROM orders;', chipotle_url)

In [ ]:
chipotle.head()

In [ ]:
chipotle.shape

In [ ]:
chipotle.describe()

In [ ]:
#2 Change str to float, replace '$', and add up orders' amounts
chipotle['total_bill'] = chipotle.item_price.str.replace('$','',regex = False).astype(float)

chipotle.groupby('order_id').total_bill.agg('sum')

In [ ]:
#3 Most popular 3 items
chipotle.groupby('item_name').quantity.agg('sum').nlargest(n=3, keep= 'all')

In [ ]:
#4 Item producing most revenue
# Need to have total price per line.
chipotle['total_item_price'] = chipotle.quantity * chipotle.item_price

chipotle.groupby('item_name').total_bill.sum().nlargest(n=1, keep= 'all')

In [ ]:
titles

In [ ]:
#5 Join 'employees' and 'titles' DFs,
emp_titles = employees.merge(titles, on='emp_no')
emp_titles.head()

In [26]:
#6 Hire date for most recent hire.
emp_titles.groupby('title').hire_date.max()

NameError: name 'emp_titles' is not defined

In [24]:
#7 Cross tab - # titles per dept

dept_title_query ='''
                    SELECT t.emp_no,
                    t.title,
                    t.from_date,
                    t.to_date,
                    d.dept_name
                    FROM departments AS d
                    JOIN dept_emp AS de USING(dept_no)
                    JOIN titles AS t USING(emp_no);
                    '''

In [25]:
dept_titles = pd.read_sql(dept_title_query, get_db_url('employees'))
dept_titles.head()

   emp_no         title   from_date     to_date         dept_name
0   10011         Staff  1990-01-22  1996-11-09  Customer Service
1   10038  Senior Staff  1996-09-20  9999-01-01  Customer Service
2   10038         Staff  1989-09-20  1996-09-20  Customer Service
3   10049  Senior Staff  2000-05-04  9999-01-01  Customer Service
4   10049         Staff  1992-05-04  2000-05-04  Customer Service